import {blur} from "./functions.js"

/*
Прив'яжіть усім інпутам наступну подію - втрата фокусу кожен інпут виводить своє value в параграф з id="test"
focus blur input

Дано інпути. Зробіть так, щоб усі інпути втрати фокусу перевіряли свій вміст на правильну кількість символів. 
Скільки символів має бути в інпуті, зазначається в атрибуті data-length. 
Якщо вбито правильну кількість, то межа інпуту стає зеленою, якщо неправильна – червоною.

- При завантаженні сторінки показати користувачеві поле введення (`input`) з написом Price. Це поле буде служити для введення числових значень
- Поведінка поля має бути такою:
- При фокусі на полі введення – у нього має з'явитися рамка зеленого кольору. При втраті фокусу вона пропадає.
- Коли забрали фокус з поля - його значення зчитується, над полем створюється span, в якому має бути виведений текст: 
- Поруч із ним має бути кнопка з хрестиком (`X`). Значення всередині поля введення фарбується зеленим.
- При натисканні на Х - span з текстом та кнопка X повинні бути видалені.
- Якщо користувач ввів число менше 0 - при втраті фокусу підсвічувати поле введення червоною рамкою, 
під полем виводити фразу - Please enter correct price. span зі значенням при цьому не створюється.
*/

const inputs = document.querySelectorAll("input");

inputs.forEach((input)=>{
    input.addEventListener("blur", blur);
})

const price = document.getElementById('price');
price.addEventListener("focus", (e) => e.target.classList.add("green-border"));
